/*
 * @Description:
 * @Date: 2024-12-09 10:50:12
 * @LastEditTime: 2024-12-13 10:24:16
 */
// GDP总量
export const GDPDATA = new Map([
  ["四川", [2000, 3000, 3000, 2000, 3000, 3000, 4000]],
  ["全国", [3000, 4000, 4000, 5000, 4000, 5000, 5000]],
])

// 人均GDP
export const GDPDATAPERSON = [2, 3, 4, 5, 6]

// 主要经济指标增速对比
export const CASHRISERATEDATA = new Map([
  ["全国", [5, 2, 6, 8, 5]],
  ["四川", [2, 1, 7, 5, 5]],
  ["河南", [3, 4, 8, -8, 8]],
  ["浙江", [4, 3, 6, 5, 5]],
])

// 人均消费性支出
export const CONSUMEPERSONDATA = [1, 2, 3, 4, 5, 6, 7]

// 全国各省工业化进程测度值
export const INDESTRYPROCESSDATA = [
  6,
  5,
  4,
  3,
  2.3,
  2.4,
  2.2,
  2,
  1.8,
  1.2,
  1,
  1,
  0.98,
  0.97,
  0.95,
  0.94,
  0.93,
  0.92,
  0.91,
  {
    value: 0.8,
    itemStyle: {
      color: "#FFC24B",
    },
  },
  0.7,
  0.6,
  0.6,
  0.8,
  0.7,
  0.6,
  0.6,
  0.8,
  0.7,
  0.6,
  0.6,
]

// 工业占GDP比重
export const INDESTRYGDPRATE = new Map([
  ["全国", [2, 10, 20, 22, 30, 34, 39, 40, 45]],
  ["江苏", [5, 15, 20, 22, 30, 34, 39, 40, 45]],
  ["浙江", [6, 14, 20, 22, 30, 34, 39, 40, 45]],
  ["山东", [8, 13, 20, 22, 30, 34, 39, 40, 45]],
  ["广州", [9, 17, 20, 22, 30, 34, 39, 40, 45]],
  ["四川", [12, 12, 20, 22, 30, 34, 39, 40, 45]],
])

/***第二屏****/
// 全社会用电量
export const SOCIETYUSEDPOWERDATA = new Map([
  ["社会", [100, 200, 300, 400, 300, 500, 600, 700]],
  ["增速", [2, 3, 4, 5, 3, 6, 7, 8]],
])

// 人均用电分析
export const PERSONUSEDPOWERDATA = new Map([
  ["全国", [200, 300, 400, 500, 600, 700, 800, 900]],
  ["四川", [100, 200, 300, 400, 500, 600, 700, 800]],
])

// 四川能源消费总量和强度
export const ENERGYUSEDTOTAL = new Map([
  ["总量", [200, 300, 400, 500, 600, 700, 800, 900]],
  ["强度", [0.3, 0.5, 0.8, 1, 1.2, 1.3, 1.7, 2]],
])

// 全国各省能源消费强度
export const ENERYUSEDDEPTH = [
  0.5,
  0.8,
  0.9,
  1,
  2,
  2.2,
  {
    value: 0.8,
    itemStyle: {
      color: "#FFC24B",
    },
  },
  2.5,
  3,
  2,
]

// 人均能源消费水平
export const PERSONUSEDRATE = new Map([
  ["全国", [200, 300, 400, 500, 600, 700, 800, 900]],
  ["四川", [100, 200, 300, 400, 500, 600, 700, 800]],
])

/***第三屏**/
// 最大最小负荷
export const MAXMINLOADDATA = new Map([
  ["最大负荷", [200, 300, 400, 500, 600, 700, 800, 900]],
  ["最小负荷", [100, 200, 300, 400, 500, 600, 700, 800]],
])

// 尖峰负荷持续时间
export const LOADDRUATIONTIMEDATA = new Map([
  ["97", [90, 80, 40, 60, 50, 100, 80, 90]],
  ["95", [80, 70, 30, 50, 40, 90, 70, 80]],
  ["92", [70, 60, 20, 40, 30, 80, 60, 70]],
  ["90", [60, 50, 10, 30, 20, 70, 50, 60]],
])

// 最大谷峰差
export const MAXHIGHLOW = [100, 200, 300, 400, 500, 600, 800]

// 分月最大负荷及用电量
export const MONTHLOADUSEDPOWER = new Map([
  [
    "最大负荷",
    [2000, 3000, 3500, 4000, 2000, 3000, 3500, 4000, 2000, 3000, 3500, 4000],
  ],
  ["用电量", [100, 200, 300, 400, 210, 320, 370, 400, 120, 200, 600, 500]],
])

// 最大负荷日负荷曲线示意图
export const DAYLOADLINEDATA = new Map([
  [
    "夏天",
    [
      200, 220, 310, 430, 240, 360, 340, 440, 100, 220, 610, 530, 200, 220, 310,
      430, 240, 360, 340, 440, 100, 220, 610, 530,
    ],
  ],
  [
    "冬天",
    [
      100, 200, 300, 400, 210, 320, 370, 400, 120, 200, 600, 500, 100, 200, 300,
      400, 210, 320, 370, 400, 120, 200, 600, 500,
    ],
  ],
])

/**第四屏 */
export const JINGGUIDATA = [50, 80, 100, 200, 300, 400, 500, 600, 800]

/**第五屏 */
// 黑金属
export const BLACKMETALDATA = new Map([
  ['用电量', [50, 80, 100, 200, 300, 400, 500, 600]],
  ['增速', [-3, 2, 4, 6, 6, 7, 10, 20]],
]) 
// 机械
export const MECHANICALDATA = new Map([
  ['用电量', [50, 80, 100, 200, 300, 400, 500, 600]],
  ['增速', [-3, 2, 4, 6, 6, 7, 10, 20]],
]) 
// 化工
export const CHEMICALDATA = new Map([
  ['用电量', [50, 80, 100, 200, 300, 400, 500, 600]],
  ['增速', [-3, 2, 4, 6, 6, 7, 10, 20]],
]) 
// 有色金属
export const COLORMETALDATA = new Map([
  ['用电量', [50, 80, 100, 200, 300, 400, 500, 600]],
  ['增速', [-3, 2, 4, 6, 6, 7, 10, 20]],
]) 
// 非金属
export const NONEMETALDATA = new Map([
  ['用电量', [50, 80, 100, 200, 300, 400, 500, 600]],
  ['增速', [-3, 2, 4, 6, 6, 7, 10, 20]],
]) 
// 通讯
export const COMMUNICATEDATA = new Map([
  ['用电量', [50, 80, 100, 200, 300, 400, 500, 600]],
  ['增速', [-3, 2, 4, 6, 6, 7, 10, 20]],
]) 
